school.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-15 Mon 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HS school</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="M. Surmashev" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">HS school</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b6c1e2">1. Health Samurai FullStack developer courses</a>
<ul>
<li><a href="#org9cf3b02">1.1. <span class="todo TODO">TODO</span> добавить болеее подробное описание курсов</a></li>
</ul>
</li>
<li><a href="#org92c0cca">2. Dev environment</a>
<ul>
<li><a href="#org9bf2575">2.1. <span class="todo TODO">TODO</span> Добавить ссылки для подготоки на соответствующие материалы</a></li>
</ul>
</li>
<li><a href="#orge68e869">3. Frontend &amp; Backend Clojure development</a>
<ul>
<li>
<ul>
<li><a href="#orge00de01">3.0.1. UI</a></li>
<li><a href="#org9d1a58d">3.0.2. Back</a></li>
<li><a href="#orgb705488">3.0.3. Tests</a></li>
</ul>
</li>
<li><a href="#org8721998">3.1. <b>Курсовая работа:</b></a></li>
</ul>
</li>
<li><a href="#orgb3af188">4. DevOps</a>
<ul>
<li><a href="#org4a0a715">4.1. План курса</a>
<ul>
<li><a href="#org22f3471">4.1.1. DevOps Culture</a></li>
<li><a href="#orgdc87546">4.1.2. Infrastructure</a></li>
<li><a href="#org091babc">4.1.3. Networking (WEB specific)</a></li>
<li><a href="#org33b12b3">4.1.4. Monitoring &amp; Audit</a></li>
</ul>
</li>
<li><a href="#org4a1656b">4.2. Курсовая работа</a></li>
</ul>
</li>
<li><a href="#orgdbda4c3">5. Database</a>
<ul>
<li><a href="#org0f5768f">5.1. Примерный план</a>
<ul>
<li><a href="#org0eb2302">5.1.1. DB for developers</a></li>
<li><a href="#orge2dad23">5.1.2. DB for administrators</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3b6c1e2" class="outline-2">
<h2 id="org3b6c1e2"><span class="section-number-2">1</span> Health Samurai FullStack developer courses</h2>
<div class="outline-text-2" id="text-1">
<p>
Цикл курсов от <a href="https://www.health-samurai.io">HealthSamurai</a> направленных на подготовку <code>FullStack</code> инженеоров.
Темы курсов:
</p>
<ul class="org-ul">
<li><b>Dev environment</b></li>
<li><b>Frontend/Backend Clj/Cljs development</b></li>
<li><b>PostgreSQL Database administration</b></li>
<li><b>DevOps</b></li>
</ul>
</div>
<div id="outline-container-org9cf3b02" class="outline-3">
<h3 id="org9cf3b02"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> добавить болеее подробное описание курсов</h3>
</div>
</div>

<div id="outline-container-org92c0cca" class="outline-2">
<h2 id="org92c0cca"><span class="section-number-2">2</span> Dev environment</h2>
<div class="outline-text-2" id="text-2">
<p>
Цель курса - познакомить обучающихся с эффективными практиками разработки.
По завершению курса:
</p>
<ul class="org-ul">
<li>Пользоваться <code>bash</code></li>
<li>Скриптовать локально/удаленно</li>
<li>Расширять свой редактор (<code>emacs</code>)</li>
</ul>
<p>
<b>Продолжительность:</b> <code>2недели</code>
<b>Количество онлайн занятий:</b> <code>2</code>
<b>Темы курса:</b>
</p>
<ul class="org-ul">
<li>Bash/Tmux</li>
<li>Git</li>
<li>Emacs/Vim</li>
<li>SSH</li>
<li>Docker</li>
<li>Touch typin</li>
</ul>
<p>
  <b>Курсовая работа:</b>
    <code>WIP:</code> Поднять в <code>DockerCompose</code> контейнер с <code>Ubuntu</code>. Написать скрипт который
установит в данный контейнер, на пример, <code>PostgreSQL</code>, либо на выбор <code>mongo</code>, <code>mysql</code>.
Написать плагин для <code>Emacs</code> с помощью которого можно выполнять <code>sql</code> зыпросы в запущенной базе.
Сдать работу в виде ссылки на <code>GitHub</code> репозиторий.
</p>
</div>

<div id="outline-container-org9bf2575" class="outline-3">
<h3 id="org9bf2575"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Добавить ссылки для подготоки на соответствующие материалы</h3>
</div>
</div>

<div id="outline-container-orge68e869" class="outline-2">
<h2 id="orge68e869"><span class="section-number-2">3</span> Frontend &amp; Backend Clojure development</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge00de01" class="outline-4">
<h4 id="orge00de01"><span class="section-number-4">3.0.1</span> UI</h4>
<div class="outline-text-4" id="text-3-0-1">
<ul class="org-ul">
<li>Re-frame reagent garden</li>
</ul>
</div>
</div>
<div id="outline-container-org9d1a58d" class="outline-4">
<h4 id="org9d1a58d"><span class="section-number-4">3.0.2</span> Back</h4>
<div class="outline-text-4" id="text-3-0-2">
<ul class="org-ul">
<li>ring middleware jdbc honey</li>
</ul>
</div>
</div>
<div id="outline-container-orgb705488" class="outline-4">
<h4 id="orgb705488"><span class="section-number-4">3.0.3</span> Tests</h4>
<div class="outline-text-4" id="text-3-0-3">
<ul class="org-ul">
<li>TDD basics</li>
<li>Multiple environments</li>
</ul>
</div>
</div>

<div id="outline-container-org8721998" class="outline-3">
<h3 id="org8721998"><span class="section-number-3">3.1</span> <b>Курсовая работа:</b></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Реализовать <code>CRUD</code> пациентов с возможностью загрузки файлов и сохранением их на
S3 подобном хранилище. Сделать авторизацию.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb3af188" class="outline-2">
<h2 id="orgb3af188"><span class="section-number-2">4</span> DevOps</h2>
<div class="outline-text-2" id="text-4">
<p>
  Курс включает в себя работу как с голым железом, так и работу с k8s кластером.
Работа с железом позволит более четко и полно понять основные задачи которые
решают DevOps инженры (да и в целом полезен данный опыт). Работа в кластере
покажет современные способы решения данных проблем.
</p>
</div>
<div id="outline-container-org4a0a715" class="outline-3">
<h3 id="org4a0a715"><span class="section-number-3">4.1</span> План курса</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org22f3471" class="outline-4">
<h4 id="org22f3471"><span class="section-number-4">4.1.1</span> DevOps Culture</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Short intro in to DevOps culture
</p>
</div>
</div>
<div id="outline-container-orgdc87546" class="outline-4">
<h4 id="orgdc87546"><span class="section-number-4">4.1.2</span> Infrastructure</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Docker</li>
<li>Docker compose</li>
<li>Ansible</li>
<li>Kubernetes</li>
<li>CI/CD
<ul class="org-ul">
<li>Preinstall</li>
<li>Secrets</li>
<li>Test &amp; Build</li>
<li>Delivery</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org091babc" class="outline-4">
<h4 id="org091babc"><span class="section-number-4">4.1.3</span> Networking (WEB specific)</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>REST</li>
<li>HTTP</li>
<li>DNS</li>
<li>Load balancing</li>
<li>Nginx/Proxy</li>
</ul>
</div>
</div>
<div id="outline-container-org33b12b3" class="outline-4">
<h4 id="org33b12b3"><span class="section-number-4">4.1.4</span> Monitoring &amp; Audit</h4>
<div class="outline-text-4" id="text-4-1-4">
<ul class="org-ul">
<li>Basic monitoring Prometheus</li>
<li>Audit ES + Kibana</li>
<li>Performance testing ?</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org4a1656b" class="outline-3">
<h3 id="org4a1656b"><span class="section-number-3">4.2</span> Курсовая работа</h3>
<div class="outline-text-3" id="text-4-2">
<p>
   Поднять в docker-compose 2 виртуальных машины. При помощи Ansible развернуть на них k8s.
Развернуть в кластере CI/CD какого-нибудь тестового приложения. Сделать поверх него мониторинг.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdbda4c3" class="outline-2">
<h2 id="orgdbda4c3"><span class="section-number-2">5</span> Database</h2>
<div class="outline-text-2" id="text-5">
<p>
  Курс разбит на два этапа. Первый ориентирован на разработчиков,
включающий в себя основые аспекты работы и внутреннего устройства
PostgreSQL. Вторая часть курса сконцентрирована сугубо на администриовании
базы банных бекапировании, реплицировании и тд
  Есть хороший референс - курсы от <a href="https://postgrespro.ru/education/courses">PostgresPro</a> они слишком обширны и фундаментальны
но думаю что их можно подсократить и адаптировать под наши нужды.
</p>
</div>
<div id="outline-container-org0f5768f" class="outline-3">
<h3 id="org0f5768f"><span class="section-number-3">5.1</span> Примерный план</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org0eb2302" class="outline-4">
<h4 id="org0eb2302"><span class="section-number-4">5.1.1</span> DB for developers</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>PG basics
<ul class="org-ul">
<li>CRUD</li>
<li>Aggregations</li>
<li>Joins</li>
</ul></li>
<li>PG core
<ul class="org-ul">
<li>MVCC</li>
<li>Vacuum</li>
</ul></li>
<li>Transaction Isolation
<ul class="org-ul">
<li>Read commited</li>
<li>Read uncommited</li>
<li>Repeatable read</li>
<li>Serializable</li>
</ul></li>
<li>Indexes
<ul class="org-ul">
<li>Btree</li>
<li>GIN</li>
<li>GIST</li>
</ul></li>
<li>Explain</li>
</ul>
</div>
</div>
<div id="outline-container-orge2dad23" class="outline-4">
<h4 id="orge2dad23"><span class="section-number-4">5.1.2</span> DB for administrators</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Basic administration
<ul class="org-ul">
<li>Postgresql config</li>
<li>Extensions</li>
</ul></li>
<li>Replication
<ul class="org-ul">
<li>Sync/async</li>
</ul></li>
<li>Backups
<ul class="org-ul">
<li>Concepts</li>
<li>CheckPoint</li>
<li>pg<sub>basebackup</sub></li>
<li>wal-e/wal-g</li>
</ul></li>
<li>Monitoring
<ul class="org-ul">
<li>raw baremetal metrics</li>
<li>transactions</li>
<li>tables</li>
<li>replicas</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-02-01</p>
<p class="author">Author: M. Surmashev</p>
<p class="date">Created: 2021-02-15 Mon 12:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
